IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cpu1tocm_ipc_regs.xml
<module id="CPU1TOCM_IPC_REGS_CMVIEW" HW_revision="" description="CPU1TOCM IPC Registers">
	<register id="CMTOCPU1IPCACK" width="32" page="1" offset="0x0" internal="0" description="CMTOCPU1IPCACK Register">
		<bitfield id="IPC0" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC0 bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="IPC1" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC1 bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IPC2" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC2 bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="IPC3" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC3 bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="IPC4" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC4 bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="IPC5" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC5 bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="IPC6" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC6 bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="IPC7" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC7 bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="IPC8" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC8 bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="IPC9" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC9 bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="IPC10" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC10 bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="IPC11" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC11 bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="IPC12" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC12 bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="IPC13" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC13 bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="IPC14" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC14 bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="IPC15" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC15 bit" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="IPC16" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC16 bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="IPC17" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC17 bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="IPC18" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC18 bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="IPC19" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC19 bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="IPC20" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC20 bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="IPC21" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC21 bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="IPC22" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC22 bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="IPC23" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC23 bit" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="IPC24" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC24 bit" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="IPC25" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC25 bit" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="IPC26" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC26 bit" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="IPC27" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC27 bit" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="IPC28" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC28 bit" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="IPC29" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC29 bit" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="IPC30" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC30 bit" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="IPC31" description="Acknowledgement from CM to CPU1TOCMIPCFLG.IPC31 bit" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU1TOCMIPCSTS" width="32" page="1" offset="0x4" internal="0" description="CPU1TOCMIPCSTS Register">
		<bitfield id="IPC0" description="IPC0 Request from  CPU1 to CM" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="IPC1" description="IPC1 Request from  CPU1 to CM" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="IPC2" description="IPC2 Request from  CPU1 to CM" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="IPC3" description="IPC3 Request from  CPU1 to CM" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="IPC4" description="IPC4 Request from  CPU1 to CM" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="IPC5" description="IPC5 Request from  CPU1 to CM" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="IPC6" description="IPC6 Request from  CPU1 to CM" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="IPC7" description="IPC7 Request from  CPU1 to CM" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="IPC8" description="IPC8 Request from  CPU1 to CM" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="IPC9" description="IPC9 Request from  CPU1 to CM" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="IPC10" description="IPC10 Request from  CPU1 to CM" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="IPC11" description="IPC11 Request from  CPU1 to CM" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="IPC12" description="IPC12 Request from  CPU1 to CM" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="IPC13" description="IPC13 Request from  CPU1 to CM" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="IPC14" description="IPC14 Request from  CPU1 to CM" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="IPC15" description="IPC15 Request from  CPU1 to CM" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="IPC16" description="IPC16 Request from  CPU1 to CM" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="IPC17" description="IPC17 Request from  CPU1 to CM" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="IPC18" description="IPC18 Request from  CPU1 to CM" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="IPC19" description="IPC19 Request from  CPU1 to CM" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="IPC20" description="IPC20 Request from  CPU1 to CM" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="IPC21" description="IPC21 Request from  CPU1 to CM" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="IPC22" description="IPC22 Request from  CPU1 to CM" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="IPC23" description="IPC23 Request from  CPU1 to CM" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="IPC24" description="IPC24 Request from  CPU1 to CM" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="IPC25" description="IPC25 Request from  CPU1 to CM" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="IPC26" description="IPC26 Request from  CPU1 to CM" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="IPC27" description="IPC27 Request from  CPU1 to CM" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="IPC28" description="IPC28 Request from  CPU1 to CM" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="IPC29" description="IPC29 Request from  CPU1 to CM" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="IPC30" description="IPC30 Request from  CPU1 to CM" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="IPC31" description="IPC31 Request from  CPU1 to CM" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="CMTOCPU1IPCSET" width="32" page="1" offset="0x8" internal="0" description="CMTOCPU1IPCSET Register">
		<bitfield id="IPC0" description="Set CMTOCPU1IPCFLG.IPC0 Flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="IPC1" description="Set CMTOCPU1IPCFLG.IPC1 Flag" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IPC2" description="Set CMTOCPU1IPCFLG.IPC2 Flag" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="IPC3" description="Set CMTOCPU1IPCFLG.IPC3 Flag" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="IPC4" description="Set CMTOCPU1IPCFLG.IPC4 Flag" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="IPC5" description="Set CMTOCPU1IPCFLG.IPC5 Flag" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="IPC6" description="Set CMTOCPU1IPCFLG.IPC6 Flag" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="IPC7" description="Set CMTOCPU1IPCFLG.IPC7 Flag" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="IPC8" description="Set CMTOCPU1IPCFLG.IPC8 Flag" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="IPC9" description="Set CMTOCPU1IPCFLG.IPC9 Flag" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="IPC10" description="Set CMTOCPU1IPCFLG.IPC10 Flag" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="IPC11" description="Set CMTOCPU1IPCFLG.IPC11 Flag" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="IPC12" description="Set CMTOCPU1IPCFLG.IPC12 Flag" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="IPC13" description="Set CMTOCPU1IPCFLG.IPC13 Flag" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="IPC14" description="Set CMTOCPU1IPCFLG.IPC14 Flag" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="IPC15" description="Set CMTOCPU1IPCFLG.IPC15 Flag" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="IPC16" description="Set CMTOCPU1IPCFLG.IPC16 Flag" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="IPC17" description="Set CMTOCPU1IPCFLG.IPC17 Flag" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="IPC18" description="Set CMTOCPU1IPCFLG.IPC18 Flag" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="IPC19" description="Set CMTOCPU1IPCFLG.IPC19 Flag" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="IPC20" description="Set CMTOCPU1IPCFLG.IPC20 Flag" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="IPC21" description="Set CMTOCPU1IPCFLG.IPC21 Flag" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="IPC22" description="Set CMTOCPU1IPCFLG.IPC22 Flag" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="IPC23" description="Set CMTOCPU1IPCFLG.IPC23 Flag" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="IPC24" description="Set CMTOCPU1IPCFLG.IPC24 Flag" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="IPC25" description="Set CMTOCPU1IPCFLG.IPC25 Flag" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="IPC26" description="Set CMTOCPU1IPCFLG.IPC26 Flag" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="IPC27" description="Set CMTOCPU1IPCFLG.IPC27 Flag" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="IPC28" description="Set CMTOCPU1IPCFLG.IPC28 Flag" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="IPC29" description="Set CMTOCPU1IPCFLG.IPC29 Flag" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="IPC30" description="Set CMTOCPU1IPCFLG.IPC30 Flag" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="IPC31" description="Set CMTOCPU1IPCFLG.IPC31 Flag" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CMTOCPU1IPCCLR" width="32" page="1" offset="0xc" internal="0" description="CMTOCPU1IPCCLR Register">
		<bitfield id="IPC0" description="Clear CMTOCPU1IPCFLG.IPC0 Flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="IPC1" description="Clear CMTOCPU1IPCFLG.IPC1 Flag" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IPC2" description="Clear CMTOCPU1IPCFLG.IPC2 Flag" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="IPC3" description="Clear CMTOCPU1IPCFLG.IPC3 Flag" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="IPC4" description="Clear CMTOCPU1IPCFLG.IPC4 Flag" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="IPC5" description="Clear CMTOCPU1IPCFLG.IPC5 Flag" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="IPC6" description="Clear CMTOCPU1IPCFLG.IPC6 Flag" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="IPC7" description="Clear CMTOCPU1IPCFLG.IPC7 Flag" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="IPC8" description="Clear CMTOCPU1IPCFLG.IPC8 Flag" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="IPC9" description="Clear CMTOCPU1IPCFLG.IPC9 Flag" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="IPC10" description="Clear CMTOCPU1IPCFLG.IPC10 Flag" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="IPC11" description="Clear CMTOCPU1IPCFLG.IPC11 Flag" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="IPC12" description="Clear CMTOCPU1IPCFLG.IPC12 Flag" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="IPC13" description="Clear CMTOCPU1IPCFLG.IPC13 Flag" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="IPC14" description="Clear CMTOCPU1IPCFLG.IPC14 Flag" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="IPC15" description="Clear CMTOCPU1IPCFLG.IPC15 Flag" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="IPC16" description="Clear CMTOCPU1IPCFLG.IPC16 Flag" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="IPC17" description="Clear CMTOCPU1IPCFLG.IPC17 Flag" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="IPC18" description="Clear CMTOCPU1IPCFLG.IPC18 Flag" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="IPC19" description="Clear CMTOCPU1IPCFLG.IPC19 Flag" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="IPC20" description="Clear CMTOCPU1IPCFLG.IPC20 Flag" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="IPC21" description="Clear CMTOCPU1IPCFLG.IPC21 Flag" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="IPC22" description="Clear CMTOCPU1IPCFLG.IPC22 Flag" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="IPC23" description="Clear CMTOCPU1IPCFLG.IPC23 Flag" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="IPC24" description="Clear CMTOCPU1IPCFLG.IPC24 Flag" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="IPC25" description="Clear CMTOCPU1IPCFLG.IPC25 Flag" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="IPC26" description="Clear CMTOCPU1IPCFLG.IPC26 Flag" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="IPC27" description="Clear CMTOCPU1IPCFLG.IPC27 Flag" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="IPC28" description="Clear CMTOCPU1IPCFLG.IPC28 Flag" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="IPC29" description="Clear CMTOCPU1IPCFLG.IPC29 Flag" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="IPC30" description="Clear CMTOCPU1IPCFLG.IPC30 Flag" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="IPC31" description="Clear CMTOCPU1IPCFLG.IPC31 Flag" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CMTOCPU1IPCFLG" width="32" page="1" offset="0x10" internal="0" description="CMTOCPU1IPCFLG Register">
		<bitfield id="IPC0" description="CM to CPU1 IPC0 Flag Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="IPC1" description="CM to CPU1 IPC1 Flag Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="IPC2" description="CM to CPU1 IPC2 Flag Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="IPC3" description="CM to CPU1 IPC3 Flag Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="IPC4" description="CM to CPU1 IPC4 Flag Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="IPC5" description="CM to CPU1 IPC5 Flag Status" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="IPC6" description="CM to CPU1 IPC6 Flag Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="IPC7" description="CM to CPU1 IPC7 Flag Status" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="IPC8" description="CM to CPU1 IPC8 Flag Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="IPC9" description="CM to CPU1 IPC9 Flag Status" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="IPC10" description="CM to CPU1 IPC10 Flag Status" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="IPC11" description="CM to CPU1 IPC11 Flag Status" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="IPC12" description="CM to CPU1 IPC12 Flag Status" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="IPC13" description="CM to CPU1 IPC13 Flag Status" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="IPC14" description="CM to CPU1 IPC14 Flag Status" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="IPC15" description="CM to CPU1 IPC15 Flag Status" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="IPC16" description="CM to CPU1 IPC16 Flag Status" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="IPC17" description="CM to CPU1 IPC17 Flag Status" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="IPC18" description="CM to CPU1 IPC18 Flag Status" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="IPC19" description="CM to CPU1 IPC19 Flag Status" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="IPC20" description="CM to CPU1 IPC20 Flag Status" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="IPC21" description="CM to CPU1 IPC21 Flag Status" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="IPC22" description="CM to CPU1 IPC22 Flag Status" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="IPC23" description="CM to CPU1 IPC23 Flag Status" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="IPC24" description="CM to CPU1 IPC24 Flag Status" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="IPC25" description="CM to CPU1 IPC25 Flag Status" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="IPC26" description="CM to CPU1 IPC26 Flag Status" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="IPC27" description="CM to CPU1 IPC27 Flag Status" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="IPC28" description="CM to CPU1 IPC28 Flag Status" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="IPC29" description="CM to CPU1 IPC29 Flag Status" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="IPC30" description="CM to CPU1 IPC30 Flag Status" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="IPC31" description="CM to CPU1 IPC31 Flag Status" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="IPCCOUNTERL" width="32" page="1" offset="0x18" internal="0" description="IPCCOUNTERL Register">
		<bitfield id="COUNT" description="IPC Counter's lower 32-bit" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="IPCCOUNTERH" width="32" page="1" offset="0x1c" internal="0" description="IPCCOUNTERH Register">
		<bitfield id="COUNT" description="IPC Counter's upper 32-bit" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1TOCMIPCRECVCOM" width="32" page="1" offset="0x20" internal="0" description="CPU1TOCMIPCRECVCOM Register">
		<bitfield id="COMMAND" description="Refelects the state of CPU1TOCMIPCSENDCOM register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1TOCMIPCRECVADDR" width="32" page="1" offset="0x24" internal="0" description="CPU1TOCMIPCRECVADDR Register">
		<bitfield id="ADDRESS" description="Refelects the state of CPU1TOCMIPCSENDADDR register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1TOCMIPCRECVDATA" width="32" page="1" offset="0x28" internal="0" description="CPU1TOCMIPCRECVDATA Register">
		<bitfield id="WDATA" description="Refelects the state of CPU1TOCMIPCSENDDATA register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CMTOCPU1IPCREPLY" width="32" page="1" offset="0x2c" internal="0" description="CMTOCPU1IPCREPLY Register">
		<bitfield id="RDATA" description="CM to CPU1 IPC Reply" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMTOCPU1IPCSENDCOM" width="32" page="1" offset="0x30" internal="0" description="CMTOCPU1IPCSENDCOM Register">
		<bitfield id="COMMAND" description="CM to CPU1 IPC Command" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMTOCPU1IPCSENDADDR" width="32" page="1" offset="0x34" internal="0" description="CMTOCPU1IPCSENDADDR Register">
		<bitfield id="ADDRESS" description="CM to CPU1 IPC Address" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMTOCPU1IPCSENDDATA" width="32" page="1" offset="0x38" internal="0" description="CMTOCPU1IPCSENDDATA Register">
		<bitfield id="WDATA" description="CM to CPU1 IPC Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CPU1TOCMIPCREPLY" width="32" page="1" offset="0x3c" internal="0" description="CPU1TOCMIPCREPLY Register">
		<bitfield id="RDATA" description="CPU1 to CM IPC Reply" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CMTOCPU1IPCBOOTSTS" width="32" page="1" offset="0x40" internal="0" description="CMTOCPU1IPCBOOTSTS Register">
		<bitfield id="BOOTSTS" description="CM to CPU1 IPC Boot Status" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CPU1TOCMIPCBOOTMODE" width="32" page="1" offset="0x44" internal="0" description="CPU1TOCMIPCBOOTMODE Register">
		<bitfield id="BOOTMODE" description="CPU1 to CM IPC Boot Mode." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PUMPREQUEST" width="32" page="1" offset="0x48" internal="0" description="PUMPREQUEST Register">
		<bitfield id="SEM" description="Flash Pump Request Semaphore between CPU1, CPU2 and CM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="Key Qualifier for writes to this register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
